# FbxLightEmitRectangleWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightEmitRectangleWidth Property
ParameterTypeId Class See Also
---
"Emit from Rectangle Width"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightEmitRectangleWidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightEmitRectangleWidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightEmitRectangleWidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace